dudasdavid/RevvyDemoKit/STM32F411/Src/main.c
}

/** Configure pins as 
        * Analog 
        * Input 
        * Output
        * EVENT_OUT
        * EXTI
*/
static void MX_GPIO_Init(void)
{

  GPIO_InitTypeDef GPIO_InitStruct;

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOE_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOC, LEFT2_FW_Pin|LEFT2_RW_Pin|SEN3_OUT_Pin|SEN4_OUT_Pin 
                          |LEFT3_FW_Pin|LEFT3_RW_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOA, SEN1_OUT_Pin|SEN2_OUT_Pin|RIGHT1_FW_Pin|RIGHT1_RW_Pin 
                          |RIGHT2_FW_Pin|RIGHT2_RW_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(LEFT1_FW_GPIO_Port, LEFT1_FW_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOD, LEFT1_RW_Pin|RIGHT3_FW_Pin|RIGHT3_RW_Pin|LD5_Pin 
                          |LD6_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pins : LEFT2_FW_Pin LEFT2_RW_Pin SEN3_OUT_Pin SEN4_OUT_Pin 
                           LEFT3_FW_Pin LEFT3_RW_Pin */
  GPIO_InitStruct.Pin = LEFT2_FW_Pin|LEFT2_RW_Pin|SEN3_OUT_Pin|SEN4_OUT_Pin 
                          |LEFT3_FW_Pin|LEFT3_RW_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pins : SEN1_OUT_Pin SEN2_OUT_Pin RIGHT1_FW_Pin RIGHT1_RW_Pin 
                           RIGHT2_FW_Pin RIGHT2_RW_Pin */
  GPIO_InitStruct.Pin = SEN1_OUT_Pin|SEN2_OUT_Pin|RIGHT1_FW_Pin|RIGHT1_RW_Pin 
                          |RIGHT2_FW_Pin|RIGHT2_RW_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : RIGHT1_ENC_B_Pin RIGHT2_ENC_B_Pin */
  GPIO_InitStruct.Pin = RIGHT1_ENC_B_Pin|RIGHT2_ENC_B_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

  /*Configure GPIO pins : LEFT1_ENC_B_Pin LEFT2_ENC_B_Pin LEFT3_ENC_B_Pin */
  GPIO_InitStruct.Pin = LEFT1_ENC_B_Pin|LEFT2_ENC_B_Pin|LEFT3_ENC_B_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pin : LEFT1_FW_Pin */
  GPIO_InitStruct.Pin = LEFT1_FW_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LEFT1_FW_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : SEN3_EXTI_Pin SEN4_EXTI_Pin SEN1_EXTI_Pin SEN2_EXTI_Pin */
  GPIO_InitStruct.Pin = SEN3_EXTI_Pin|SEN4_EXTI_Pin|SEN1_EXTI_Pin|SEN2_EXTI_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING_FALLING;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pin : RIGHT3_ENC_B_Pin */
  GPIO_InitStruct.Pin = RIGHT3_ENC_B_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  HAL_GPIO_Init(RIGHT3_ENC_B_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : LEFT1_RW_Pin RIGHT3_FW_Pin RIGHT3_RW_Pin LD5_Pin 
                           LD6_Pin */
  GPIO_InitStruct.Pin = LEFT1_RW_Pin|RIGHT3_FW_Pin|RIGHT3_RW_Pin|LD5_Pin 
                          |LD6_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pins : LEFT1_EXTI0_Pin LEFT2_EXTI1_Pin LEFT3_EXTI2_Pin RIGHT1_EXTI3_Pin 
                           RIGHT2_EXTI4_Pin RIGHT3_EXTI5_Pin */
  GPIO_InitStruct.Pin = LEFT1_EXTI0_Pin|LEFT2_EXTI1_Pin|LEFT3_EXTI2_Pin|RIGHT1_EXTI3_Pin 
                          |RIGHT2_EXTI4_Pin|RIGHT3_EXTI5_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /* EXTI interrupt init*/
  HAL_NVIC_SetPriority(EXTI0_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(EXTI0_IRQn);

  HAL_NVIC_SetPriority(EXTI1_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(EXTI1_IRQn);

  HAL_NVIC_SetPriority(EXTI2_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(EXTI2_IRQn);

  HAL_NVIC_SetPriority(EXTI3_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(EXTI3_IRQn);

  HAL_NVIC_SetPriority(EXTI4_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(EXTI4_IRQn);

  HAL_NVIC_SetPriority(EXTI9_5_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(EXTI9_5_IRQn);

}

/* USER CODE BEGIN 4 */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin){
  switch ( GPIO_Pin ) {
  case GPIO_PIN_0:
    if (HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_12)) mot1Cntr--;
    else mot1Cntr++;
    break;
  case GPIO_PIN_1:
    if (HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_13)) mot2Cntr--;
    else mot2Cntr++;
    break;
  case GPIO_PIN_2:
    if (HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_14)) mot3Cntr--;
    else mot3Cntr++;
    break;
  case GPIO_PIN_3:
    if (HAL_GPIO_ReadPin(GPIOE, GPIO_PIN_7)) mot4Cntr--;
    else mot4Cntr++;
    break;
  case GPIO_PIN_4:
    if (HAL_GPIO_ReadPin(GPIOE, GPIO_PIN_8)) mot5Cntr--;
    else mot5Cntr++;
    break;
  case GPIO_PIN_5:
    if (HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_10)) mot6Cntr--;
    else mot6Cntr++;
    break;
  case GPIO_PIN_6:
    sen1Cntr++;
    break; 
  case GPIO_PIN_7:
    sen2Cntr++;
    break; 
  case GPIO_PIN_8:
    sen3Cntr++;
    break; 
  case GPIO_PIN_9:
    sen4Cntr++;
    break; 
  default:
    break;
  }
}

float filter2 (float avg, float input, float alpha) {
  avg = (alpha * input) + (1.0 - alpha) * avg;
  return avg;
}

void saturateInteger(int16_t* i, int16_t min, int16_t max) {
  int16_t val = *i;
  if (val < min) val = min;
  else if (val > max) val = max;
  *i = val;
}

void saturateVolatileFloat(volatile float* i, float min, float max) {
  float val = *i;
  if (val < min) val = min;
  else if (val > max) val = max;
  *i = val;
}

void calculateLRSpeeds(float r, float phi) {

  phi = phi * PI / 180.0;
  
  if ((phi >= 0) && (phi < PI / 2.0)) //1st quadrant
  {
      referenceSpeedLeft = r;
      referenceSpeedRight = -r * cosf(2 * phi);
  }
  else if ((phi >= PI / 2.0) && (phi < PI)) //2nd quadrant
  {
      referenceSpeedLeft = -r * cosf(2 * phi);
      referenceSpeedRight = r;
  }
  else if ((phi >= PI) && (phi < 3 * PI / 2.0)) //3rd quadrant
  {
      referenceSpeedLeft = -r;
      referenceSpeedRight = r * cosf(2 * phi);
  }
  else if ((phi >= 3 * PI / 2.0) && (phi <= 2 * PI)) //4th quadrant
  {
      referenceSpeedLeft = r * cosf(2 * phi);
      referenceSpeedRight = -r;
  }
}
/* USER CODE END 4 */

